In [1]:
import pandas as pd
import numpy as np
from env import host, user, password


url = f'mysql+pymysql://{user}:{password}@{host}/telco_churn'
    
sql = '''
SELECT customer_id, `monthly_charges`, tenure, total_charges
FROM customers
WHERE contract_type_id = 3
;
'''

customers = pd.read_sql(sql, url)

In [2]:
customers.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [3]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [4]:
customers[customers["total_charges"].str.contains(' ')]

     customer_id  monthly_charges  tenure total_charges
234   1371-DWPAZ            56.05       0
416   2520-SGTTA            20.00       0
453   2775-SEFEE            61.90       0
505   3115-CZMZD            20.25       0
524   3213-VVOLG            25.35       0
678   4075-WKNIU            73.35       0
716   4367-NUYAO            25.75       0
726   4472-LVYGI            52.55       0
941   5709-LVOEQ            80.85       0
1293  7644-OMVMY            19.85       0

In [5]:
customers = customers.replace(' ', np.nan)

In [6]:
customers = customers.dropna()
customers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 65.8+ KB

In [7]:
customers.total_charges = customers["total_charges"].astype(float)

In [8]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

In [9]:
customers["total_charges_2"] = customers.tenure * customers.monthly_charges

In [10]:
customers.drop(columns = ["total_charges"], inplace = True)

In [11]:
customers = customers.rename(columns = {"total_charges_2": "total_charges"})

In [12]:
customers

     customer_id  monthly_charges  tenure  total_charges
0     0013-SMEOE           109.70      71        7788.70
1     0014-BMAQU            84.65      63        5332.95
2     0016-QLJIS            90.45      65        5879.25
3     0017-DINOC            45.20      54        2440.80
4     0017-IUDMW           116.80      72        8409.60
...          ...              ...     ...            ...
1690  9964-WBQDJ            24.40      71        1732.40
1691  9972-EWRJS            19.25      67        1289.75
1692  9975-GPKZU            19.75      46         908.50
1693  9993-LHIEB            67.85      67        4545.95
1694  9995-HOTOH            59.00      63        3717.00

[1685 rows x 4 columns]

In [1]:
from wrangle import wrangle_telco

In [2]:
telco = wrangle_telco()

In [3]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB